Revit 2025 API
Grid.Create(Document, Line) Method
 Creates a new grid line.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public static Grid Create(
	Document document,
	Line line
)
Public Shared Function Create (
	document As Document,
	line As Line
) As Grid
public:
static Grid^ Create(
	Document^ document,
	Line^ line
)
static member Create :
        document : Document *
        line : Line -> Grid
Parameters
document Document
 The document in which the new instance is created.
line Line
 A line which represents the location of the grid line.
Return Value
Grid
 The newly created grid line.
Exceptions
Exception | Condition
ArgumentException |  document is not a project document. -or- The input line is not on horizontal plane.
ArgumentNullException |  A non-optional argument was null
Remarks
 The line should be on a horizontal plane.
Example
// Create the geometry line which the grid locates
 XYZ start = new XYZ(0, 0, 0);
 XYZ end = new XYZ(30, 30, 0);
 Line geomLine = Line.CreateBound(start, end);
 // Create a grid using the geometry line
 Grid lineGrid = Grid.Create(document, geomLine);
 if (null == lineGrid)
 {
     throw new Exception("Create a new straight grid failed.");
 }
 // Modify the name of the created grid
 lineGrid.Name = "New Name1";
   ' Create the geometry line which the grid locates
   Dim start As New XYZ(0, 0, 0)
   Dim [end] As New XYZ(30, 30, 0)
   Dim geomLine As Line = Line.CreateBound(start, [end])
   ' Create a grid using the geometry line
Dim lineGrid As Grid = Grid.Create(document, geomLine)
   If lineGrid Is Nothing Then
       Throw New Exception("Create a new straight grid failed.")
   End If
   ' Modify the name of the created grid
   lineGrid.Name = "New Name1"
No code example is currently available or this language may not be supported.
No code example is currently available or this language may not be supported.
See Also
Reference
Grid Class
Create Overload
Autodesk.Revit.DB Namespace